TestBase/src/Documents/ПриходныйОрдер/ПриходныйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходныйОрдер</name>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <attributes>
    <name>ВходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TestBase/src/AccumulationRegisters/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Товары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

TestBase/src/Documents/ПриходныйОрдер/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.Товары.Записывать = Истина;
	Движения.Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПриходныйОрдерТовары.Номенклатура,
	|	СУММА(ПриходныйОрдерТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.ПриходныйОрдер.Товары КАК ПриходныйОрдерТовары
	|ГДЕ
	|	ПриходныйОрдерТовары.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ПриходныйОрдерТовары.Номенклатура,
	|	ПриходныйОрдерТовары.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезЗапроса = Запрос.Выполнить();
	Выборка = РезЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Запись = Движения.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Период = Дата;
		
	КонецЦикла;

	// FIXME 

	
КонецПроцедуры
